{
  "location": "Williamson County, IL",
  "county": "Williamson County",
  "state": "IL",
  "coordinates": "37.7306, -88.9331",
  "pin": ["10-27-400-005"],
  "technology": "Solar",
  "request_date": "2025-09-10",
  "risk_score": 2.8,
  "overview_summary": "The adjacent neighbors consist mainly of long-term local landowners and farming families. Several parcels are held by family trusts or multi-generational residents with deep ties to the area's agricultural community. None of these individuals have a publicly documented stance on the project based on available records.",
  "residents_summary": "Local property owners primarily consist of established farming families with generational ties to the area. Most holdings are structured through revocable trusts for estate planning purposes.",
  "organizations_summary": "Single investment entity with out-of-state management focused on local real estate acquisition and development. The LLC demonstrates active property flipping rather than long-term ownership patterns.",
  "neighbors": [
    {
      "neighbor_id": "N-01",
      "name": "Henry, Rebecca C.",
      "entity_category": "Resident",
      "entity_type": "individual",
      "pins": ["10-27-400-006"],
      "claims": "Rebecca C. Henry owns a neighboring parcel and is a local resident on Day Road in Marion, Illinois:contentReference[oaicite:0]{index=0}. Public voter records confirm she was registered and voted in the 2020 general election from that address:contentReference[oaicite:1]{index=1}. No public information was found indicating any specific occupation or civic role for her, and her position on the development project is unknown. As no stance is recorded, a prudent next step would be to review local county or township meeting minutes from 2023–2025 for any comments by nearby residents:contentReference[oaicite:2]{index=2}.",
      "confidence": "high"
    },
    {
      "neighbor_id": "N-02",
      "name": "Kimmel, Larry & Amy Revocable Trust",
      "entity_category": "Resident",
      "entity_type": "trust",
      "pins": ["10-27-300-003"],
      "claims": "The Larry and Amy Kimmel Revocable Trust holds this parcel, reflecting a long-time local farm family's land ownership:contentReference[oaicite:3]{index=3}. In November 2022, Larry M. Kimmel and his wife Amy L. Kimmel transferred their Marion-area property into the revocable trust:contentReference[oaicite:4]{index=4}. Amy Kimmel was a farm wife active in Home Extension and a 4-H club leader for many years:contentReference[oaicite:5]{index=5}. She passed away in late 2023:contentReference[oaicite:6]{index=6}, leaving Larry (also known as Marvin Kimmel) as the surviving trustee. Marvin \"Larry\" Kimmel is a lifelong farmer in the area, having received over $41,000 in USDA farm disaster subsidies since 1995:contentReference[oaicite:7]{index=7}. There is no public record of the Kimmels' stance on the project, and no evidence of direct involvement in local energy or zoning debates. Given the family's agricultural ties, reviewing local Farm Bureau proceedings or county board minutes for any input from Larry Kimmel would be a reasonable next step:contentReference[oaicite:8]{index=8}.",
      "confidence": "high"
    },
    {
      "neighbor_id": "N-03",
      "name": "Montgomery, Walter L. & Patricia A. (Trustees)",
      "entity_category": "Resident",
      "entity_type": "trust",
      "pins": ["10-35-100-004"],
      "claims": "Walter L. Montgomery and his wife Patricia \"Patty\" A. Montgomery of Benton, IL are listed as trustees owning this adjacent parcel:contentReference[oaicite:9]{index=9}. The Montgomerys are an established farming family; Walter L. Montgomery (based in neighboring Franklin County) has received nearly $95,000 in federal farm conservation payments, indicating significant land holdings and long-term agricultural involvement:contentReference[oaicite:10]{index=10}. They appear to hold the property in a trust, suggesting estate planning for generational land continuity. The couple resides outside Williamson County and has no noted public roles in the local community. Their stance on the proposed development is not documented in public sources. Because they are absentee owners, a useful next step might be to monitor any land sale listings or county zoning filings related to this parcel for indications of their intentions:contentReference[oaicite:11]{index=11}.",
      "confidence": "high"
    },
    {
      "neighbor_id": "N-04",
      "name": "Hudgens, Gene Herman",
      "entity_category": "Resident",
      "entity_type": "individual",
      "pins": ["10-35-100-003", "10-35-100-006"],
      "claims": "Gene Herman Hudgens is a lifelong area resident who now solely owns two adjacent parcels. One tract was formerly co-owned with his sister, Saundra Kaye Douglas:contentReference[oaicite:12]{index=12}. Saundra (Hudgens) Douglas was deeply involved in the local agricultural community – she and her late husband ran the Goreville Livestock Auction for 26 years before retiring in 2006:contentReference[oaicite:13]{index=13}. After Saundra's passing in August 2024:contentReference[oaicite:14]{index=14}, Gene Herman Hudgens became the sole owner of their shared parcel in June 2025 through an estate transfer:contentReference[oaicite:15]{index=15}:contentReference[oaicite:16]{index=16}. The Hudgens family has longstanding roots near the Lake of Egypt area, and Gene Herman, now in his 80s, is a well-known local figure by virtue of this generational presence. There is no record of him taking a public position on the development project. His stance remains unknown, so reviewing recent county board or planning commission transcripts for any comments by Mr. Hudgens or his representatives would be a logical next step:contentReference[oaicite:17]{index=17}.",
      "confidence": "high"
    },
    {
      "neighbor_id": "N-05",
      "name": "J. Michele LLC",
      "entity_category": "Organization",
      "entity_type": "llc",
      "pins": ["10-35-206-001", "10-35-200-027", "10-35-206-002"],
      "claims": "J. Michele LLC is a limited liability company that owns multiple adjacent parcels in this area, with a combined assessed land value of roughly $59,000 in 2024:contentReference[oaicite:18]{index=18}. The company was formed in June 2023 and is managed by its registered agent and sole member, Jawanda Smith, who is based in New Orleans, Louisiana:contentReference[oaicite:19]{index=19}. J. Michele LLC has been active in local real estate: it purchased a downtown Marion commercial property (via a transfer from Jellen Enterprises Inc.) and later sold it in mid-2024 to a local business (Crown Brew LLC) at a substantial profit:contentReference[oaicite:20]{index=20}:contentReference[oaicite:21]{index=21}. This history indicates the LLC is focused on land investment and property flipping rather than long-term ownership for personal use. The firm does not have a known physical presence or employees in Williamson County, and it has not publicly expressed any position on the development project. Given its investment role, a reasonable next step would be to monitor any land use filings or marketing of these parcels by J. Michele LLC for signs of its intentions regarding the project:contentReference[oaicite:22]{index=22}.",
      "confidence": "high"
    }
  ]
}